#==============================================================================
# ★ RGSS3_自動色調 Ver1.0
#==============================================================================
=begin

作者：tomoaky
webサイト：ひきも記は閉鎖しました。 (http://hikimoki.sakura.ne.jp/)

色調をマップごとに設定し、マップ移動時に自動的に切り替わるようにします。
  
マップのメモ欄に <色調 赤, 緑, 青, グレースケール> のタグを書き込むことで
マップ単位で色調を指定することができます。
  例）<色調 17, -34, -34, 0>

2014.10.14  Ver1.0
  ・公開

=end

#==============================================================================
# □ 設定項目
#==============================================================================
module TMATONE
  # 色調タグがない場合に色調を初期設定に変更するか（false で前マップを引き継ぐ）
  USE_DEFAULT_TONE = true
  
  # 色調の初期設定（[赤, 緑, 青, グレースケール]）
  DEFAULT_TONE = [0, 0, 0, 0]
end

#==============================================================================
# ■ Game_Map
#==============================================================================
class Game_Map
  #--------------------------------------------------------------------------
  # ● セットアップ
  #--------------------------------------------------------------------------
  alias tmatone_game_map_setup setup
  def setup(map_id)
    tmatone_game_map_setup(map_id)
    setup_tone
  end
  #--------------------------------------------------------------------------
  # ○ 色調のセットアップ
  #--------------------------------------------------------------------------
  def setup_tone
    if /<色調\s*(\-*\d+)\s*,\s*(\-*\d+)\s*,\s*(\-*\d+)\s*,\s*(\d+)\s*>/ =~ @map.note
      @screen.start_tone_change(Tone.new($1.to_i, $2.to_i, $3.to_i, $4.to_i), 0)
    elsif TMATONE::USE_DEFAULT_TONE
      @screen.start_tone_change(Tone.new(*TMATONE::DEFAULT_TONE), 0)
    end
  end
end

