=begin
#==============================================================================
[名前]    ステートの残りターン数表示+α
[作者]    焼きノリ
[配布元]  まったりツクール雑貨 http://mata-tuku.ldblog.jp/
#------------------------------------------------------------------------------
[更新履歴]
・2012/10/28 公開
・2012/12/01 不具合修正。「表示優先度0のステートアイコン非表示」機能追加
#==============================================================================

#------------------------------------------------------------------------------
[対応]
・RGSS3のみ可能
#------------------------------------------------------------------------------

#------------------------------------------------------------------------------
[機能]
・戦闘中のみ、ステート、能力変化の残りターン数をアイコンに表示します。
・表示優先度が0のステートのアイコンは非表示にします。
#------------------------------------------------------------------------------

#------------------------------------------------------------------------------
[使用方法]
・特別な操作はありません。このスクリプトを導入するだけで効果が出ます。
#------------------------------------------------------------------------------

[再定義箇所]
・Window_Base の draw_actor_icons
#------------------------------------------------------------------------------
  [○ : 新規定義,  ◎ : エイリアス定義,  ● : 再定義]
#------------------------------------------------------------------------------
=end
$YkNr_Scripts ||= {}
$YkNr_Scripts[:ShowStatesTurns] = true
#※このスクリプトを使用しない場合は、↑を false にすること

if $YkNr_Scripts[:ShowStatesTurns]
#==============================================================================
# ■ Game_BattlerBase
#==============================================================================
class Game_BattlerBase
  #--------------------------------------------------------------------------
  # ◎ 現在のステートをアイコン番号の配列で取得
  #--------------------------------------------------------------------------
  alias yknr_ShowStatesTurnsGame_BattlerBase_state_icons :state_icons
  def state_icons
    states = self.states.select {|state| !state.priority.zero? }
    yknr_ShowStatesTurnsGame_BattlerBase_state_icons
  end
  #--------------------------------------------------------------------------
  # ○ 現在のステートを残りターン数の配列で取得
  #--------------------------------------------------------------------------
  def state_turns
    turns = []
    states.each do |s|
      if !s.icon_index.zero?
        is_turn = !s.auto_removal_timing.zero? && !s.priority.zero?
        turn = is_turn ? @state_turns[s.id].truncate : -1
        turns.push(turn)
      end
    end
    turns
  end
  #--------------------------------------------------------------------------
  # ○ 現在の強化／弱体を残りターン数の配列で取得
  #--------------------------------------------------------------------------
  def buff_turns
    turns = []
    @buffs.each_with_index do |lv, i|
      turns.push(@buff_turns[i].truncate) if !lv.zero?
    end
    turns
  end
end

#==============================================================================
# ■ Window_Base
#==============================================================================
class Window_Base < Window
  #--------------------------------------------------------------------------
  # ● ステートおよび強化／弱体のアイコンを描画
  #--------------------------------------------------------------------------
  def draw_actor_icons(actor, x, y, width = 96)
    last_font = contents.font.clone
    contents.font.size = 19
    contents.font.bold = true
    contents.font.color = crisis_color
    icons = (actor.state_icons + actor.buff_icons)[0, width / 24]
    turns = (actor.state_turns + actor.buff_turns)[0, width / 24]
    icons.each_with_index do |n, i|
      draw_icon(n, x + 24 * i, y)
      if $game_party.in_battle && turns[i] != -1
        draw_text(x + 24 * i, y, 24, line_height, turns[i] + 1, 2)
      end
    end
    contents.font = last_font
  end
end
end # $YkNr_Scripts