#==============================================================================
# ■ RPG::State
#------------------------------------------------------------------------------
# ステートのデータクラス。
#==============================================================================
class RPG::State < RPG::BaseItem
  def invalid_clear_states
    return @note.include?("[全回復無効ステート]")
  end
end
#==============================================================================
# ■ Game_BattlerBase
#------------------------------------------------------------------------------
# 　バトラーを扱う基本のクラスです。主に能力値計算のメソッドを含んでいます。こ
# のクラスは Game_Battler クラスのスーパークラスとして使用されます。
#==============================================================================
class Game_BattlerBase
  #--------------------------------------------------------------------------
  # ● ステート情報をクリア
  #--------------------------------------------------------------------------
  def clear_states
    return init_states_data if @states.nil?
    data = @states.clone
    for i in data
      state = $data_states[i]
      next if state.nil?
      unless state.invalid_clear_states
        @states.delete(i)
        @state_turns.delete(i)
        @state_steps.delete(i)
      end
    end
  end
  #--------------------------------------------------------------------------
  # ● ステート情報の初期化
  #--------------------------------------------------------------------------
  def init_states_data
    @states = []
    @state_turns = {}
    @state_steps = {}
  end
  #--------------------------------------------------------------------------
  # ● 全回復
  #--------------------------------------------------------------------------
  def recover_all
    clear_states
    return unless alive?
    @hp = mhp
    @mp = mmp
  end
end
#==============================================================================
# ■ Game_Actor
#------------------------------------------------------------------------------
# 　アクターを扱うクラスです。このクラスは Game_Actors クラス（$game_actors）
# の内部で使用され、Game_Party クラス（$game_party）からも参照されます。
#==============================================================================
class Game_Actor < Game_Battler
  #--------------------------------------------------------------------------
  # ● インスタンスの複製
  #--------------------------------------------------------------------------
  alias ums_invalidate_all_recover_state_setup setup
  #--------------------------------------------------------------------------
  # ● セットアップ
  #--------------------------------------------------------------------------
  def setup(actor_id)
    # ▼ ゲーム開始時ゲームオーバー発生バグ防止。
    @hp = 1
    ums_invalidate_all_recover_state_setup(actor_id)
  end
end