#==============================================================================
# ★ RGSS3_クリティカル効果音 Ver1.0
#==============================================================================
=begin

作者：tomoaky
webサイト：ひきも記 (http://hikimoki.sakura.ne.jp/)

クリティカル表示に効果音による演出を追加します、
アクター側、エネミー側で別々の効果音を指定することができます。

2012.03.07  Ver1.0
  公開

=end

#==============================================================================
# □ 設定項目
#==============================================================================
module TMCRISE
  # アクターがクリティカルを【受けたとき】の効果音
  ACTOR_SE = RPG::SE.new("gucha004a", 80, 120)

  # エネミーがクリティカルを【受けたとき】の効果音
  ENEMY_SE = RPG::SE.new("gucha004a", 90, 110)
end

#==============================================================================
# ■ Window_BattleLog
#==============================================================================
class Window_BattleLog
  #--------------------------------------------------------------------------
  # ● クリティカルヒットの表示
  #--------------------------------------------------------------------------
  alias tmcrise_window_battlelog_display_critical display_critical
  def display_critical(target, item)
    if target.result.critical
      target.actor? ? TMCRISE::ACTOR_SE.play : TMCRISE::ENEMY_SE.play
    end
    tmcrise_window_battlelog_display_critical(target, item)
  end
end

