#==============================================================================
# ★ プレイヤー足音
# 作成・配布元：misty_rain(http://kilisamenosekai.web.fc2.com/)
# ver:1.0　作成(2012/06/23) 
# ver:2.0　更新(2014/10/12) 
# 
# 特定の地形タグが指定されたタイルを
# プレイヤーが踏むと足音が鳴るようになります。
# ver:2.0
# 足音の設定をmodule内に入れました。
# 歩く足音が交互に別の音が鳴らせるようになりました。
# ダッシュ中(特定のキー押下中)は別の音が鳴らせるようになりました。
# ※ver1.0をすでにご利用中の場合は、ver2.0で上書きしてください。
#  お手数ですがその際、効果音の設定は手動で移してください。
#==============================================================================
module MR_FOOT_STEP_SE
  # 足音を有効化するスイッチNo(ONでプレイヤーの足音が鳴っちゃうようになる。)
  ENABLE_SW = 25
  
  # ダッシュのキー
  DASH_KEY = :SHIFT
  
  # 効果音の設定　お好みの設定に変えてください
  STEP_SE = {
    1 => [  # 地形タグ 1基本足音
        ["asioto",75,100], # 歩く足音1 "『SE名』",『ボリューム』,『ピッチ』
        ["asioto",75,100], # 歩く足音2 "『SE名』",『ボリューム』,『ピッチ』
        ["asioto",75,120], # 走る足音1 "『SE名』",『ボリューム』,『ピッチ』
        ["asioto",75,120]  # 走る足音2 "『SE名』",『ボリューム』,『ピッチ』
      ],
    2 => [  # 地形タグ 2草
        ["足音・草歩",75,100], # 歩く足音1 "『SE名』",『ボリューム』,『ピッチ』
        ["足音・草歩",75,100], # 歩く足音2 "『SE名』",『ボリューム』,『ピッチ』
        ["足音・草歩",75,120], # 走る足音1 "『SE名』",『ボリューム』,『ピッチ』
        ["足音・草歩",75,120]  # 走る足音2 "『SE名』",『ボリューム』,『ピッチ』
      ],
    3 => [  # 地形タグ 3土・砂
        ["足音・土",75,100], # 歩く足音1 "『SE名』",『ボリューム』,『ピッチ』
        ["足音・土",75,100], # 歩く足音2 "『SE名』",『ボリューム』,『ピッチ』
        ["足音・土",75,120], # 走る足音1 "『SE名』",『ボリューム』,『ピッチ』
        ["足音・土",75,120]  # 走る足音2 "『SE名』",『ボリューム』,『ピッチ』
      ],
    4 => [  # 地形タグ 4水
        ["Water10",75,100], # 歩く足音1 "『SE名』",『ボリューム』,『ピッチ』
        ["Water10",75,100], # 歩く足音2 "『SE名』",『ボリューム』,『ピッチ』
        ["Water10",75,120], # 走る足音1 "『SE名』",『ボリューム』,『ピッチ』
        ["Water10",75,120]  # 走る足音2 "『SE名』",『ボリューム』,『ピッチ』
      ],
    5 => [  # 地形タグ 5酸
        ["酸",75,180], # 歩く足音1 "『SE名』",『ボリューム』,『ピッチ』
        ["酸",75,180], # 歩く足音2 "『SE名』",『ボリューム』,『ピッチ』
        ["酸",75,200], # 走る足音1 "『SE名』",『ボリューム』,『ピッチ』
        ["酸",75,200]  # 走る足音2 "『SE名』",『ボリューム』,『ピッチ』
      ],
    6 => [  # 地形タグ 6鉄
        ["足音・鉄板",75,100], # 歩く足音1 "『SE名』",『ボリューム』,『ピッチ』
        ["足音・鉄板",75,100], # 歩く足音2 "『SE名』",『ボリューム』,『ピッチ』
        ["足音・鉄板",75,120], # 走る足音1 "『SE名』",『ボリューム』,『ピッチ』
        ["足音・鉄板",75,120]  # 走る足音2 "『SE名』",『ボリューム』,『ピッチ』
      ],
    7 => [  # 地形タグ 7雪
        ["snow",75,50], # 歩く足音1 "『SE名』",『ボリューム』,『ピッチ』
        ["snow2",75,60], # 歩く足音2 "『SE名』",『ボリューム』,『ピッチ』
        ["snow",75,70], # 走る足音1 "『SE名』",『ボリューム』,『ピッチ』
        ["snow2",75,90]  # 走る足音2 "『SE名』",『ボリューム』,『ピッチ』
      ]
  
  }
  
end  
#==============================================================================
# ■ Game_Player
#------------------------------------------------------------------------------
# キャラクターを扱っちゃう基本のクラスです。全てのキャラクターに共通する、
# 座標やグラフィックなどの基本的な情報を保持しちゃいます。
#==============================================================================
class Game_Player
  #--------------------------------------------------------------------------
  # ● 歩行／足踏みアニメの更新　上書き
  #--------------------------------------------------------------------------
  def update_animation
    update_anime_count
    if @anime_count > 18 - real_move_speed * 2
      update_anime_pattern
      @anime_count = 0
      walking_se
    end
  end
  #--------------------------------------------------------------------------
  # ● 足音
  #--------------------------------------------------------------------------
  def walking_se
    if $game_switches[MR_FOOT_STEP_SE::ENABLE_SW]
      if moving? and ( @pattern == 1 or @pattern == 3)
        t_tag = terrain_tag
        step_se_info = MR_FOOT_STEP_SE::STEP_SE[t_tag]
        step_se_id = 0
        if step_se_info != nil
          if @pattern == 1
            step_se_id = 0
          else
            step_se_id = 1
          end
          if Input.press?(MR_FOOT_STEP_SE::DASH_KEY)
            step_se_id = step_se_id + 2
          end
          if step_se_info.size == 4
            
            if step_se_info[step_se_id].size == 3
            
              se = RPG::SE.new(
                step_se_info[step_se_id][0],
                step_se_info[step_se_id][1],
                step_se_info[step_se_id][2]
              )
              se.play
            else
              p "地形タグ" + t_tag.to_s + ":効果音の設定に誤り？"
            end
          else
            p "地形タグ" + t_tag.to_s + ":足音が４種(歩1,歩2,走1,走2)ではない？"
          end
        else
          p "地形タグ" + t_tag.to_s + ":設定されていない地形タグ"
        end
      end
    end
  end
end