#===============================================================================
#★　RGSS3 簡易難易度変更　Ver1.00  by ヒール
#-------------------------------------------------------------------------------
#敵の強さなどを変数で管理するスクリプトです。
#基本ステータスなどを割合で変動させます。
#-------------------------------------------------------------------------------
#・経験値を変動させたくない敵のメモ欄に<経験値変動無効>と書くと変動しなくなります。
#主にメタル系やボス敵に使う事を想定しています。
#・お金を変動させたくない敵のメモ欄に<お金変動無効>と書くと変動しなくなります。
#主にゴールド系やボス敵に使う事を想定しています。
#===============================================================================
module Hi_ru_Difficulty

  #以下は設定項目になります。
 
  #難易度の設定に使用する変数の「変数番号」です。
  #デフォルトでは変数９番の値が参照されるようになっています。
  
  VARIABLES = 60
           
  #難易度の各種項目の設定です。
  #縦列が１つの難易度に適用される変化割合の設定になっています。
  #例えば参照した変数が1（いわゆるイージー）の場合、
  #各ステータスなどが0.8倍になります。(配列は0から始まるため)
  #使用しない項目（経験値は難易度で変えないなど）でも値は入力してください。
  
  #アイテムドロップ率はパーティー能力のドロップ率２倍と併用されます。
  #クリティカルダメージ倍率は敵味方両方に適用されます。
  #防御・魔法防御はあまり大きく上げすぎると攻撃が通らなくなるので、
  #気をつけて設定してください。
  #また、運もステートの確率に影響するので気をつけてください。
  
  DIFFICULTY_SETTING=[
  [ 1.0, 1.5, 2.0, 2.5, 3.0, 3.5, 4.0, 5.0, 6.0, 7.0, 10, 20, 30, 40, 50, 60,
    70, 80, 90, 100], #最大HP
  [ 1.0, 1.5, 2.0, 2.5, 3.0, 3.5, 4.0, 5.0, 6.0, 7.0, 10, 20, 30, 40, 50, 60,
    70, 80, 90, 100], #最大MP
  [ 1.0, 1.5, 2.0, 2.5, 3.0, 3.5, 4.0, 5.0, 6.0, 7.0, 10, 20, 30, 40, 50, 60,
    70, 80, 90, 100], #攻撃力
  [ 1.0, 1.5, 2.0, 2.5, 3.0, 3.5, 4.0, 5.0, 6.0, 7.0, 10, 20, 30, 40, 50, 60,
    70, 80, 90, 100], #防御力
  [ 1.0, 1.5, 2.0, 2.5, 3.0, 3.5, 4.0, 5.0, 6.0, 7.0, 10, 20, 30, 40, 50, 60,
    70, 80, 90, 100], #魔法力
  [ 1.0, 1.5, 2.0, 2.5, 3.0, 3.5, 4.0, 5.0, 6.0, 7.0, 10, 20, 30, 40, 50, 60,
    70, 80, 90, 100], #魔法防御
  [ 1.0, 1.5, 2.0, 2.5, 3.0, 3.5, 4.0, 5.0, 6.0, 7.0, 10, 20, 30, 40, 50, 60,
    70, 80, 90, 100], #敏捷性
  [ 1.0, 1.5, 2.0, 2.5, 3.0, 3.5, 4.0, 4.0, 4.0, 4.0, 4.0, 4.0, 4.0, 4.0, 4.0,
    4.0, 4.0, 4.0, 4.0, 4.0], #運
  [ 0, 0, 0, 0, 0, 0, 0,0,0,0,0,0,0,0,0,0,0,0,0,0], #経験値
  [ 1.0, 1.5, 2.0, 2.5, 3.0, 3.5, 4.0, 4.0, 4.0, 5.0, 6.0, 7.0, 8.0, 9.0, 10, 10,
    10, 10, 10, 10, 10], #お金
  [ 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0,
    1.0, 1.0, 1.0, 1.0, 1.0], #アイテムドロップ倍率
  [ 3.0, 3.0, 3.0, 3.0, 3.0, 3.0, 3.0, 3.0,3.0,3.0,3.0,3.0,3.0,3.0,3.0,3.0,3.0,
    3.0, 3.0, 3.0,]  #クリティカルダメージ倍率]
  
  ]
  
  #設定はここまでです。

end

#==============================================================================
# ■ Game_Enemy
#------------------------------------------------------------------------------
# 　敵キャラを扱うクラスです。このクラスは Game_Troop クラス（$game_troop）の
# 内部で使用されます。
#==============================================================================
class Game_Enemy < Game_Battler
  #--------------------------------------------------------------------------
  # ● 通常能力値の取得
  #--------------------------------------------------------------------------
  alias difficult_param param
  def param(param_id)
    value = param_base(param_id) + param_plus(param_id)
    value *= param_rate(param_id) * param_buff_rate(param_id) * dif_rate(param_id)
    [[value, param_max(param_id)].min, param_min(param_id)].max.to_i
  end
  #--------------------------------------------------------------------------
  # ● 経験値の取得
  #--------------------------------------------------------------------------
  alias difficult_exp exp
  def exp
    difficult_exp
    if /<経験値変動無効>/ =~ enemy.note
      enemy.exp
    else
      (enemy.exp * Hi_ru_Difficulty::DIFFICULTY_SETTING[8][$game_variables[Hi_ru_Difficulty::VARIABLES]]).round
    end
  end
  #--------------------------------------------------------------------------
  # ● お金の取得
  #--------------------------------------------------------------------------
  alias difficult_gold gold
  def gold
    difficult_gold
    if /<お金変動無効>/ =~ enemy.note
      enemy.gold
    else
      (enemy.gold * Hi_ru_Difficulty::DIFFICULTY_SETTING[9][$game_variables[Hi_ru_Difficulty::VARIABLES]]).round
    end
  end
  #--------------------------------------------------------------------------
  # ● ドロップアイテム取得率の倍率を取得
  #--------------------------------------------------------------------------
  alias difficult_drop_item_rate drop_item_rate
  def drop_item_rate
    difficult_drop_item_rate
    ($game_party.drop_item_double? ? 2 : 1)*Hi_ru_Difficulty::DIFFICULTY_SETTING[10][$game_variables[Hi_ru_Difficulty::VARIABLES]]
  end
  #--------------------------------------------------------------------------
  # ● 難易度による変化率の取得
  #--------------------------------------------------------------------------
  def dif_rate(param_id)
   return Hi_ru_Difficulty::DIFFICULTY_SETTING[param_id][$game_variables[Hi_ru_Difficulty::VARIABLES]]
  end
end

#==============================================================================
# ■ Game_Battler
#------------------------------------------------------------------------------
# 　スプライトや行動に関するメソッドを追加したバトラーのクラスです。このクラス
# は Game_Actor クラスと Game_Enemy クラスのスーパークラスとして使用されます。
#==============================================================================

class Game_Battler < Game_BattlerBase
  #--------------------------------------------------------------------------
  # ● クリティカルダメージの設定
  #--------------------------------------------------------------------------
  def apply_critical(damage)
    damage * Hi_ru_Difficulty::DIFFICULTY_SETTING[11][$game_variables[Hi_ru_Difficulty::VARIABLES]]
  end
end