#==============================================================================
# □ XP画面サイズ（for VX Ace）
#------------------------------------------------------------------------------
# Version : 1_20111222 　　　　　　　　　NGマップサイズ　20x15以下
# by サリサ・タイクーン
# http://www.tycoon812.com/rgss/
#==============================================================================

#==============================================================================
# □ 素材スイッチ
#==============================================================================
$rgsslab = {} if $rgsslab == nil
$rgsslab["XP画面サイズ"] = true

if $rgsslab["XP画面サイズ"]

#==============================================================================
# □ カスタマイズポイント
#==============================================================================
module RGSSLAB end
module RGSSLAB::XP_Display_Size
  #--------------------------------------------------------------------------
  # ○ 戦闘画面の画像サポート
  #    戦闘画面時に表示される画像方法についての設定です。
  #
  #    1 : 引き伸ばし（676x516)
  #        使われる戦闘画面の画像が676x516でない場合
  #        自動的に676x516へ引き伸ばしを行います。
  #    ----------------------------------------------------------------------
  #    2 : 左上表示
  #        センタリングされずに、通常通りに左上に表示させます。
  #    ----------------------------------------------------------------------
  #    それ以外は、デフォルトと同じ（中央寄せ）となります。
  #--------------------------------------------------------------------------
  BATTLE_TYPE = 1
  #--------------------------------------------------------------------------
  # ○ タイトル画面の画像サポート
  #    タイトル画面時に表示される画像方法についての設定です。
  #
  #    1 : 引き伸ばし（640x480)
  #        使われるタイトル画面の画像が640x480でない場合
  #        自動的に640x480へ引き伸ばしを行います。
  #    ----------------------------------------------------------------------
  #    2 : 左上表示
  #        センタリングされずに、通常通りに左上に表示させます。
  #    ----------------------------------------------------------------------
  #    それ以外は、デフォルトと同じ（中央寄せ）となります。
  #--------------------------------------------------------------------------
  TITLE_TYPE = 1
  #--------------------------------------------------------------------------
  # ○ ゲームオーバー画面の画像サポート
  #    ゲームオーバー画面時に表示される画像表示方法についての設定です。
  #
  #    1 : 引き伸ばし（640x480）
  #        使われるゲームオーバー画面の画像が640x480でない場合
  #        自動的に640x480へ引き伸ばしを行います。
  #    ----------------------------------------------------------------------
  #    2 : 中央寄せ
  #        タイトル画面と同様に、画像を中央に寄せます。
  #    ----------------------------------------------------------------------
  #    それ以外は、デフォルトと同じ（左上表示）となります。
  #--------------------------------------------------------------------------
  GAMEOVER_TYPE = 1
end

# カスタマイズポイントは、ここまで

#==============================================================================
# □ RGSSLAB::XP_Display_Size [module]
#==============================================================================
module RGSSLAB::XP_Display_Size
  #--------------------------------------------------------------------------
  # ○ 素材設定用の定数定義
  #--------------------------------------------------------------------------
  MATERIAL_NAME = "画面サイズ拡張"
  VERSION       = 1
  RELEASE       = 20111222
end

#==============================================================================
# ■ Spriteset_Battle [class]
#==============================================================================
class Spriteset_Battle
  #--------------------------------------------------------------------------
  # ○ モジュールの設定
  #--------------------------------------------------------------------------
  RGSSLAB_023 = RGSSLAB::XP_Display_Size
  #--------------------------------------------------------------------------
  # ● 戦闘背景（床）スプライトの作成 [再定義]
  #--------------------------------------------------------------------------
  alias default1 create_battleback1
  def create_battleback1
    case RGSSLAB_023::BATTLE_TYPE
    when 1  ; create_battleback1_type1
    when 2  ; create_battleback1_type2
    else    ; default1
    end
  end
  #--------------------------------------------------------------------------
  # ○ 戦闘背景（床）スプライトの作成：引き伸ばし
  #--------------------------------------------------------------------------
  def create_battleback1_type1
    battleback1_bg = battleback1_bitmap
    resize = Bitmap.new(676, 516)
    resize.stretch_blt(resize.rect, battleback1_bg, battleback1_bg.rect)
    @back1_sprite = Sprite.new(@viewport1)
    @back1_sprite.bitmap = resize
    @back1_sprite.z = 0
  end
  #--------------------------------------------------------------------------
  # ○ 戦闘背景（床）スプライトの作成：左上表示
  #--------------------------------------------------------------------------
  def create_battleback1_type2
    @back1_sprite = Sprite.new(@viewport1)
    @back1_sprite.bitmap = battleback1_bitmap
    @back1_sprite.z = 0
  end
  #--------------------------------------------------------------------------
  # ● 戦闘背景（壁）スプライトの作成 [再定義]
  #--------------------------------------------------------------------------
  alias default2 create_battleback2
  def create_battleback2
    case RGSSLAB_023::BATTLE_TYPE
    when 1  ; create_battleback2_type1
    when 2  ; create_battleback2_type2
    else    ; default2
    end
  end
  #--------------------------------------------------------------------------
  # ○ 戦闘背景（壁）スプライトの作成：引き伸ばし
  #--------------------------------------------------------------------------
  def create_battleback2_type1
    battleback2_bg = battleback2_bitmap
    resize = Bitmap.new(676, 516)
    resize.stretch_blt(resize.rect, battleback2_bg, battleback2_bg.rect)
    @back2_sprite = Sprite.new(@viewport1)
    @back2_sprite.bitmap = resize
    @back2_sprite.z = 1
  end
  #--------------------------------------------------------------------------
  # ○ 戦闘背景（壁）スプライトの作成：左上表示
  #--------------------------------------------------------------------------
  def create_battleback2_type2
    @back2_sprite = Sprite.new(@viewport1)
    @back2_sprite.bitmap = battleback2_bitmap
    @back2_sprite.z = 1
  end
end

#==============================================================================
# ■ Scene_Title [class]
#==============================================================================
class Scene_Title < Scene_Base
  #--------------------------------------------------------------------------
  # ○ モジュールの設定
  #--------------------------------------------------------------------------
  RGSSLAB_023 = RGSSLAB::XP_Display_Size
  #--------------------------------------------------------------------------
  # ● 背景の作成 [再定義]
  #--------------------------------------------------------------------------
  alias default create_background
  def create_background
    case RGSSLAB_023::TITLE_TYPE
    when 1  ; create_background_type1
    when 2  ; create_background_type2
    else    ; default
    end
  end
  #--------------------------------------------------------------------------
  # ○ 背景の作成：引き伸ばし
  #--------------------------------------------------------------------------
  def create_background_type1
    title_bg1 = Cache.title1($data_system.title1_name)
    title_bg2 = Cache.title2($data_system.title2_name)
    resize1 = resize2 = Bitmap.new(640, 480)
    resize1.stretch_blt(resize1.rect, title_bg1, title_bg1.rect)
    resize2.stretch_blt(resize2.rect, title_bg2, title_bg2.rect)
    @sprite1 = @sprite2 = Sprite.new
    @sprite1.bitmap = resize1
    @sprite2.bitmap = resize2
  end
  #--------------------------------------------------------------------------
  # ○ 背景の作成：左上表示
  #--------------------------------------------------------------------------
  def create_background_type2
    @sprite1 = Sprite.new
    @sprite1.bitmap = Cache.title1($data_system.title1_name)
    @sprite2 = Sprite.new
    @sprite2.bitmap = Cache.title2($data_system.title2_name)
  end
end

#==============================================================================
# ■ Scene_Gameover [class]
#==============================================================================
class Scene_Gameover < Scene_Base
  #--------------------------------------------------------------------------
  # ○ モジュールの設定
  #--------------------------------------------------------------------------
  RGSSLAB_023 = RGSSLAB::XP_Display_Size
  #--------------------------------------------------------------------------
  # ● 背景の作成 [再定義]
  #--------------------------------------------------------------------------
  alias default create_background
  def create_background
    case RGSSLAB_023::GAMEOVER_TYPE
    when 1 ; create_background_type1
    when 2 ; create_background_type2
    else   ; default
    end
  end
  #--------------------------------------------------------------------------
  # ○ 背景の作成：引き伸ばし
  #--------------------------------------------------------------------------
  def create_background_type1
    gameover_bg = Cache.system("GameOver")
    resize = Bitmap.new(640, 480)
    resize.stretch_blt(resize.rect, gameover_bg, gameover_bg.rect)
    @sprite = Sprite.new
    @sprite.bitmap = resize
  end
  #--------------------------------------------------------------------------
  # ○ 背景の作成：中央寄せ
  #--------------------------------------------------------------------------
  def create_background_type2
    default
    center_sprite(@sprite)
  end
  #--------------------------------------------------------------------------
  # ○ スプライトを画面中央に移動
  #--------------------------------------------------------------------------
  def center_sprite(sprite)
    sprite.ox = sprite.bitmap.width / 2
    sprite.oy = sprite.bitmap.height / 2
    sprite.x = Graphics.width / 2
    sprite.y = Graphics.height / 2
  end
end

Graphics.resize_screen(640, 480)

end